public class Menu {
    public void showMenu() {
        System.out.println("""
                \n===== ГЛАВНОЕ МЕНЮ =====
                1. Показать все товары;
                2. Создать продукт;
                0. Выйти из приложения.
                """);
    }
}